[Hebrew_chs]
1000 = חיפוש פעיל
1001 = או לחץ על חיבור ברגע
1002 = השתמש בחיבור "Bluetooth" באייפון שלך
1003 = אנא הפעל את "Bluetooth" בטלפון שלך
1004 = מחפש ...
1005 = השלם את החיפוש
1006 = ביטול
1007 = ממתין לחיבור ...
1008 = או חיבור USB
1009 = לחץ כדי להתחבר
1010 = התחברות
1011 = Connect Fail...
1012=Delete
1013=Connect your phone with USB
1014=Updating... DO NOT power off
1015=Update success
1016=Update failed
1017=Reboot
1018=Need to complete activation
1019=Hardware fail

1020 = התחברות
1030=Setup
[-Hebrew_chs-]
